zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f4xx.h
/* Bit definition for Ethernet MAC MDIO Address Register */
#define ETH_MACMDIOAR_PSE_Pos                         (27U)
#define ETH_MACMDIOAR_PSE_Msk                         (0x1UL << ETH_MACMDIOAR_PSE_Pos) /*!< 0x08000000 */
#define ETH_MACMDIOAR_PSE                             ETH_MACMDIOAR_PSE_Msk    /* Preamble Suppression Enable */
#define ETH_MACMDIOAR_BTB_Pos                         (26U)
#define ETH_MACMDIOAR_BTB_Msk                         (0x1UL << ETH_MACMDIOAR_BTB_Pos) /*!< 0x04000000 */
#define ETH_MACMDIOAR_BTB                             ETH_MACMDIOAR_BTB_Msk    /* Back to Back transactions */
#define ETH_MACMDIOAR_PA_Pos                          (21U)
#define ETH_MACMDIOAR_PA_Msk                          (0x1FUL << ETH_MACMDIOAR_PA_Pos) /*!< 0x03E00000 */
#define ETH_MACMDIOAR_PA                              ETH_MACMDIOAR_PA_Msk     /* Physical Layer Address */
#define ETH_MACMDIOAR_RDA_Pos                         (16U)
#define ETH_MACMDIOAR_RDA_Msk                         (0x1FUL << ETH_MACMDIOAR_RDA_Pos) /*!< 0x001F0000 */
#define ETH_MACMDIOAR_RDA                             ETH_MACMDIOAR_RDA_Msk    /* Register/Device Address */
#define ETH_MACMDIOAR_RDA_PLCA_CR                     ((uint32_t)0x00000000)  /* PLCA control register address */
#define ETH_MACMDIOAR_RDA_PLCA_NODECR_Pos             (16U)
#define ETH_MACMDIOAR_RDA_PLCA_NODECR_Msk             (0x1UL << ETH_MACMDIOAR_RDA_PLCA_NODECR_Pos) /*!< 0x00010000 */
#define ETH_MACMDIOAR_RDA_PLCA_NODECR                 ETH_MACMDIOAR_RDA_PLCA_NODECR_Msk   /* PLCA node control register address */
#define ETH_MACMDIOAR_RDA_PLCA_SR_Pos                 (17U)
#define ETH_MACMDIOAR_RDA_PLCA_SR_Msk                 (0x1UL << ETH_MACMDIOAR_RDA_PLCA_SR_Pos) /*!< 0x00020000 */
#define ETH_MACMDIOAR_RDA_PLCA_SR                     ETH_MACMDIOAR_RDA_PLCA_SR_Msk   /* PLCA status register address */
#define ETH_MACMDIOAR_RDA_PLCA_TMR_Pos                (16U)
#define ETH_MACMDIOAR_RDA_PLCA_TMR_Msk                (0x3UL << ETH_MACMDIOAR_RDA_PLCA_TMR_Pos) /*!< 0x00030000 */
#define ETH_MACMDIOAR_RDA_PLCA_TMR                    ETH_MACMDIOAR_RDA_PLCA_TMR_Msk   /* PLCA timer register address */
#define ETH_MACMDIOAR_RDA_PLCA_BUF_DEPTH_Pos          (18U)
#define ETH_MACMDIOAR_RDA_PLCA_BUF_DEPTH_Msk          (0x1UL << ETH_MACMDIOAR_RDA_PLCA_BUF_DEPTH_Pos) /*!< 0x00040000 */
#define ETH_MACMDIOAR_RDA_PLCA_BUF_DEPTH              ETH_MACMDIOAR_RDA_PLCA_BUF_DEPTH_Msk   /* PLCA buffer depth register address */
#define ETH_MACMDIOAR_RDA_PCS_CR_Pos                  (16U)
#define ETH_MACMDIOAR_RDA_PCS_CR_Msk                  (0xBUL << ETH_MACMDIOAR_RDA_PCS_CR_Pos) /*!< 0x000B0000 */
#define ETH_MACMDIOAR_RDA_PCS_CR                      ETH_MACMDIOAR_RDA_PCS_CR_Msk   /* PCS control register address */
#define ETH_MACMDIOAR_RDA_PCS_SR_Pos                  (18U)
#define ETH_MACMDIOAR_RDA_PCS_SR_Msk                  (0x3UL << ETH_MACMDIOAR_RDA_PCS_SR_Pos) /*!< 0x000C0000 */
#define ETH_MACMDIOAR_RDA_PCS_SR                      ETH_MACMDIOAR_RDA_PCS_SR_Msk   /* PCS status register address */
#define ETH_MACMDIOAR_RDA_PCS_DIAG1_Pos               (16U)
#define ETH_MACMDIOAR_RDA_PCS_DIAG1_Msk               (0xDUL << ETH_MACMDIOAR_RDA_PCS_DIAG1_Pos) /*!< 0x000D0000 */
#define ETH_MACMDIOAR_RDA_PCS_DIAG1                   ETH_MACMDIOAR_RDA_PCS_DIAG1_Msk   /* PCS diagnostic 1 register address */
#define ETH_MACMDIOAR_RDA_PCS_DIAG2_Pos               (17U)
#define ETH_MACMDIOAR_RDA_PCS_DIAG2_Msk               (0x7UL << ETH_MACMDIOAR_RDA_PCS_DIAG2_Pos) /*!< 0x000E0000 */
#define ETH_MACMDIOAR_RDA_PCS_DIAG2                   ETH_MACMDIOAR_RDA_PCS_DIAG2_Msk   /* PCS diagnostic 2 register address */
#define ETH_MACMDIOAR_RDA_PCS_JBTMR_Pos               (16U)
#define ETH_MACMDIOAR_RDA_PCS_JBTMR_Msk               (0xFUL << ETH_MACMDIOAR_RDA_PCS_JBTMR_Pos) /*!< 0x000F0000 */
#define ETH_MACMDIOAR_RDA_PCS_JBTMR                   ETH_MACMDIOAR_RDA_PCS_JBTMR_Msk   /* PCS jabber timer register address */
#define ETH_MACMDIOAR_RDA_PMA_EXTABLTY_Pos            (18U)
#define ETH_MACMDIOAR_RDA_PMA_EXTABLTY_Msk            (0x5UL << ETH_MACMDIOAR_RDA_PMA_EXTABLTY_Pos) /*!< 0x00140000 */
#define ETH_MACMDIOAR_RDA_PMA_EXTABLTY                ETH_MACMDIOAR_RDA_PMA_EXTABLTY_Msk   /* PMA extended ability register address */
#define ETH_MACMDIOAR_RDA_PMA_PMD_CR_Pos              (16U)
#define ETH_MACMDIOAR_RDA_PMA_PMD_CR_Msk              (0x15UL << ETH_MACMDIOAR_RDA_PMA_PMD_CR_Pos) /*!< 0x00150000 */
#define ETH_MACMDIOAR_RDA_PMA_PMD_CR                  ETH_MACMDIOAR_RDA_PMA_PMD_CR_Msk   /* PMA PMD control register address */
#define ETH_MACMDIOAR_RDA_PMA_CR_Pos                  (17U)
#define ETH_MACMDIOAR_RDA_PMA_CR_Msk                  (0xBUL << ETH_MACMDIOAR_RDA_PMA_CR_Pos) /*!< 0x00160000 */
#define ETH_MACMDIOAR_RDA_PMA_CR                      ETH_MACMDIOAR_RDA_PMA_CR_Msk   /* PMA control register address */
#define ETH_MACMDIOAR_RDA_PMA_SR_Pos                  (16U)
#define ETH_MACMDIOAR_RDA_PMA_SR_Msk                  (0x17UL << ETH_MACMDIOAR_RDA_PMA_SR_Pos) /*!< 0x00170000 */
#define ETH_MACMDIOAR_RDA_PMA_SR                      ETH_MACMDIOAR_RDA_PMA_SR_Msk   /* PMA status register address */
#define ETH_MACMDIOAR_RDA_PMA_TMCR_Pos                (19U)
#define ETH_MACMDIOAR_RDA_PMA_TMCR_Msk                (0x3UL << ETH_MACMDIOAR_RDA_PMA_TMCR_Pos) /*!< 0x00180000 */
#define ETH_MACMDIOAR_RDA_PMA_TMCR                    ETH_MACMDIOAR_RDA_PMA_TMCR_Msk   /* PMA test mode control register address */
#define ETH_MACMDIOAR_RDA_PMA_DR_Pos                  (16U)
#define ETH_MACMDIOAR_RDA_PMA_DR_Msk                  (0x19UL << ETH_MACMDIOAR_RDA_PMA_DR_Pos) /*!< 0x00190000 */
#define ETH_MACMDIOAR_RDA_PMA_DR                      ETH_MACMDIOAR_RDA_PMA_DR_Msk   /* PMA debug mode register address */
#define ETH_MACMDIOAR_NTC_Pos                         (12U)
#define ETH_MACMDIOAR_NTC_Msk                         (0x7UL << ETH_MACMDIOAR_NTC_Pos) /*!< 0x00007000 */
#define ETH_MACMDIOAR_NTC                             ETH_MACMDIOAR_NTC_Msk    /* Number of Trailing Clocks */
#define ETH_MACMDIOAR_CR_Pos                          (8U)
#define ETH_MACMDIOAR_CR_Msk                          (0xFUL << ETH_MACMDIOAR_CR_Pos) /*!< 0x00000F00 */
#define ETH_MACMDIOAR_CR                              ETH_MACMDIOAR_CR_Msk     /* CSR Clock Range */
#define ETH_MACMDIOAR_CR_DIV42                        ((uint32_t)0x00000000)   /* CSR clock/42 */
#define ETH_MACMDIOAR_CR_DIV62_Pos                    (8U)
#define ETH_MACMDIOAR_CR_DIV62_Msk                    (0x1UL << ETH_MACMDIOAR_CR_DIV62_Pos) /*!< 0x00000100 */
#define ETH_MACMDIOAR_CR_DIV62                        ETH_MACMDIOAR_CR_DIV62_Msk /* CSR clock/62 */
#define ETH_MACMDIOAR_CR_DIV16_Pos                    (9U)
#define ETH_MACMDIOAR_CR_DIV16_Msk                    (0x1UL << ETH_MACMDIOAR_CR_DIV16_Pos) /*!< 0x00000200 */
#define ETH_MACMDIOAR_CR_DIV16                        ETH_MACMDIOAR_CR_DIV16_Msk /* CSR clock/16 */
#define ETH_MACMDIOAR_CR_DIV26_Pos                    (8U)
#define ETH_MACMDIOAR_CR_DIV26_Msk                    (0x3UL << ETH_MACMDIOAR_CR_DIV26_Pos) /*!< 0x00000300 */
#define ETH_MACMDIOAR_CR_DIV26                        ETH_MACMDIOAR_CR_DIV26_Msk /* CSR clock/26 */
#define ETH_MACMDIOAR_CR_DIV102_Pos                   (10U)
#define ETH_MACMDIOAR_CR_DIV102_Msk                   (0x1UL << ETH_MACMDIOAR_CR_DIV102_Pos) /*!< 0x00000400 */
#define ETH_MACMDIOAR_CR_DIV102                       ETH_MACMDIOAR_CR_DIV102_Msk /* CSR clock/102 */
#define ETH_MACMDIOAR_CR_DIV124_Pos                   (8U)
#define ETH_MACMDIOAR_CR_DIV124_Msk                   (0x5UL << ETH_MACMDIOAR_CR_DIV124_Pos) /*!< 0x00000500 */
#define ETH_MACMDIOAR_CR_DIV124                       ETH_MACMDIOAR_CR_DIV124_Msk /* CSR clock/124 */
#define ETH_MACMDIOAR_CR_DIV4AR_Pos                   (11U)
#define ETH_MACMDIOAR_CR_DIV4AR_Msk                   (0x1UL << ETH_MACMDIOAR_CR_DIV4AR_Pos) /*!< 0x00000800 */
#define ETH_MACMDIOAR_CR_DIV4AR                       ETH_MACMDIOAR_CR_DIV4AR_Msk /* CSR clock/4: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV6AR_Pos                   (8U)
#define ETH_MACMDIOAR_CR_DIV6AR_Msk                   (0x9UL << ETH_MACMDIOAR_CR_DIV6AR_Pos) /*!< 0x00000900 */
#define ETH_MACMDIOAR_CR_DIV6AR                       ETH_MACMDIOAR_CR_DIV6AR_Msk /* CSR clock/6: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV8AR_Pos                   (9U)
#define ETH_MACMDIOAR_CR_DIV8AR_Msk                   (0x5UL << ETH_MACMDIOAR_CR_DIV8AR_Pos) /*!< 0x00000A00 */
#define ETH_MACMDIOAR_CR_DIV8AR                       ETH_MACMDIOAR_CR_DIV8AR_Msk /* CSR clock/8: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV10AR_Pos                  (8U)
#define ETH_MACMDIOAR_CR_DIV10AR_Msk                  (0xBUL << ETH_MACMDIOAR_CR_DIV10AR_Pos) /*!< 0x00000B00 */
#define ETH_MACMDIOAR_CR_DIV10AR                      ETH_MACMDIOAR_CR_DIV10AR_Msk /* CSR clock/10: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV12AR_Pos                  (10U)
#define ETH_MACMDIOAR_CR_DIV12AR_Msk                  (0x3UL << ETH_MACMDIOAR_CR_DIV12AR_Pos) /*!< 0x00000C00 */
#define ETH_MACMDIOAR_CR_DIV12AR                      ETH_MACMDIOAR_CR_DIV12AR_Msk /* CSR clock/12: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV14AR_Pos                  (8U)
#define ETH_MACMDIOAR_CR_DIV14AR_Msk                  (0xDUL << ETH_MACMDIOAR_CR_DIV14AR_Pos) /*!< 0x00000D00 */
#define ETH_MACMDIOAR_CR_DIV14AR                      ETH_MACMDIOAR_CR_DIV14AR_Msk /* CSR clock/14: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV16AR_Pos                  (9U)
#define ETH_MACMDIOAR_CR_DIV16AR_Msk                  (0x7UL << ETH_MACMDIOAR_CR_DIV16AR_Pos) /*!< 0x00000E00 */
#define ETH_MACMDIOAR_CR_DIV16AR                      ETH_MACMDIOAR_CR_DIV16AR_Msk /* CSR clock/16: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_CR_DIV18AR_Pos                  (8U)
#define ETH_MACMDIOAR_CR_DIV18AR_Msk                  (0xFUL << ETH_MACMDIOAR_CR_DIV18AR_Pos) /*!< 0x00000F00 */
#define ETH_MACMDIOAR_CR_DIV18AR                      ETH_MACMDIOAR_CR_DIV18AR_Msk /* CSR clock/18: MDC clock above range specified in IEEE */
#define ETH_MACMDIOAR_SKAP_Pos                        (4U)
#define ETH_MACMDIOAR_SKAP_Msk                        (0x1UL << ETH_MACMDIOAR_SKAP_Pos) /*!< 0x00000010 */
#define ETH_MACMDIOAR_SKAP                            ETH_MACMDIOAR_SKAP_Msk   /* Skip Address Packet */
#define ETH_MACMDIOAR_MOC_Pos                         (2U)
#define ETH_MACMDIOAR_MOC_Msk                         (0x3UL << ETH_MACMDIOAR_MOC_Pos) /*!< 0x0000000C */
#define ETH_MACMDIOAR_MOC                             ETH_MACMDIOAR_MOC_Msk    /* MII Operation Command */
#define ETH_MACMDIOAR_MOC_WR_Pos                      (2U)
#define ETH_MACMDIOAR_MOC_WR_Msk                      (0x1UL << ETH_MACMDIOAR_MOC_WR_Pos) /*!< 0x00000004 */
#define ETH_MACMDIOAR_MOC_WR                          ETH_MACMDIOAR_MOC_WR_Msk /* Write */
#define ETH_MACMDIOAR_MOC_PRDIA_Pos                   (3U)
#define ETH_MACMDIOAR_MOC_PRDIA_Msk                   (0x1UL << ETH_MACMDIOAR_MOC_PRDIA_Pos) /*!< 0x00000008 */
#define ETH_MACMDIOAR_MOC_PRDIA                       ETH_MACMDIOAR_MOC_PRDIA_Msk /* Post Read Increment Address for Clause 45 PHY */
#define ETH_MACMDIOAR_MOC_RD_Pos                      (2U)
#define ETH_MACMDIOAR_MOC_RD_Msk                      (0x3UL << ETH_MACMDIOAR_MOC_RD_Pos) /*!< 0x0000000C */
#define ETH_MACMDIOAR_MOC_RD                          ETH_MACMDIOAR_MOC_RD_Msk /* Read */
#define ETH_MACMDIOAR_C45E_Pos                        (1U)
#define ETH_MACMDIOAR_C45E_Msk                        (0x1UL << ETH_MACMDIOAR_C45E_Pos) /*!< 0x00000002 */
#define ETH_MACMDIOAR_C45E                            ETH_MACMDIOAR_C45E_Msk   /* Clause 45 PHY Enable */
#define ETH_MACMDIOAR_MB_Pos                          (0U)
#define ETH_MACMDIOAR_MB_Msk                          (0x1UL << ETH_MACMDIOAR_MB_Pos) /*!< 0x00000001 */
#define ETH_MACMDIOAR_MB                              ETH_MACMDIOAR_MB_Msk     /* MII Busy */

