zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f4xx.h
/********************  Bit definition for DMA2D_IFCR register  ****************/
#define DMA2D_IFCR_CTEIF_Pos                (0U)
#define DMA2D_IFCR_CTEIF_Msk                (0x1UL << DMA2D_IFCR_CTEIF_Pos)         /*!< 0x00000001 */
#define DMA2D_IFCR_CTEIF                    DMA2D_IFCR_CTEIF_Msk                    /*!< Clears Transfer Error Interrupt Flag         */
#define DMA2D_IFCR_CTCIF_Pos                (1U)
#define DMA2D_IFCR_CTCIF_Msk                (0x1UL << DMA2D_IFCR_CTCIF_Pos)         /*!< 0x00000002 */
#define DMA2D_IFCR_CTCIF                    DMA2D_IFCR_CTCIF_Msk                    /*!< Clears Transfer Complete Interrupt Flag      */
#define DMA2D_IFCR_CTWIF_Pos                (2U)
#define DMA2D_IFCR_CTWIF_Msk                (0x1UL << DMA2D_IFCR_CTWIF_Pos)         /*!< 0x00000004 */
#define DMA2D_IFCR_CTWIF                    DMA2D_IFCR_CTWIF_Msk                    /*!< Clears Transfer Watermark Interrupt Flag     */
#define DMA2D_IFCR_CAECIF_Pos               (3U)
#define DMA2D_IFCR_CAECIF_Msk               (0x1UL << DMA2D_IFCR_CAECIF_Pos)        /*!< 0x00000008 */
#define DMA2D_IFCR_CAECIF                   DMA2D_IFCR_CAECIF_Msk                   /*!< Clears CLUT Access Error Interrupt Flag      */
#define DMA2D_IFCR_CCTCIF_Pos               (4U)
#define DMA2D_IFCR_CCTCIF_Msk               (0x1UL << DMA2D_IFCR_CCTCIF_Pos)        /*!< 0x00000010 */
#define DMA2D_IFCR_CCTCIF                   DMA2D_IFCR_CCTCIF_Msk                   /*!< Clears CLUT Transfer Complete Interrupt Flag */
#define DMA2D_IFCR_CCEIF_Pos                (5U)
#define DMA2D_IFCR_CCEIF_Msk                (0x1UL << DMA2D_IFCR_CCEIF_Pos)         /*!< 0x00000020 */
#define DMA2D_IFCR_CCEIF                    DMA2D_IFCR_CCEIF_Msk                    /*!< Clears Configuration Error Interrupt Flag    */
#define DMA2D_IFCR_RBCIE_Pos                (8U)
#define DMA2D_IFCR_RBCIE_Msk                (0x1UL << DMA2D_IFCR_RBCIE_Pos)         /*!< 0x00000100 */
#define DMA2D_IFCR_RBCIE                    DMA2D_IFCR_RBCIE_Msk                    /*!< Clears Configuration  Error Interrupt Enable */
#define DMA2D_IFCR_RBEIE_Pos                (9U)
#define DMA2D_IFCR_RBEIE_Msk                (0x1UL << DMA2D_IFCR_RBEIE_Pos)         /*!< 0x00000200 */
#define DMA2D_IFCR_RBEIE                    DMA2D_IFCR_RBEIE_Msk                    /*!< Clears Configuration  Error Interrupt Enable */
#define DMA2D_IFCR_CLSIE_Pos                (12U)
#define DMA2D_IFCR_CLSIE_Msk                (0x1UL << DMA2D_IFCR_CLSIE_Pos)         /*!< 0x00001000 */
#define DMA2D_IFCR_CLSIE                    DMA2D_IFCR_CLSIE_Msk                    /*!< Clears Configuration  Error Interrupt Enable */
#define DMA2D_IFCR_CLEIE_Pos                (13U)
#define DMA2D_IFCR_CLEIE_Msk                (0x1UL << DMA2D_IFCR_CLEIE_Pos)         /*!< 0x00002000 */
#define DMA2D_IFCR_CLEIE                    DMA2D_IFCR_CLEIE_Msk                    /*!< Clears Configuration  Error Interrupt Enable */
#define DMA2D_IFCR_CGPF0IF_Pos              (16U)
#define DMA2D_IFCR_CGPF0IF_Msk              (0x1UL << DMA2D_IFCR_CGPF0IF_Pos)       /*!< 0x00000100 */
#define DMA2D_IFCR_CGPF0IF                  DMA2D_IFCR_CGPF0IF_Msk                  /*!< Clears General Purpose Flag 0 Interrupt Flag */
#define DMA2D_IFCR_CGPF1IF_Pos              (17U)
#define DMA2D_IFCR_CGPF1IF_Msk              (0x1UL << DMA2D_IFCR_CGPF1IF_Pos)       /*!< 0x00000200 */
#define DMA2D_IFCR_CGPF1IF                  DMA2D_IFCR_CGPF1IF_Msk                  /*!< Clears General Purpose Flag 1 Interrupt Flag */
#define DMA2D_IFCR_CGPF2IF_Pos              (18U)
#define DMA2D_IFCR_CGPF2IF_Msk              (0x1UL << DMA2D_IFCR_CGPF2IF_Pos)       /*!< 0x00000400 */
#define DMA2D_IFCR_CGPF2IF                  DMA2D_IFCR_CGPF2IF_Msk                  /*!< Clears General Purpose Flag 2 Interrupt Flag */
#define DMA2D_IFCR_CGPF3IF_Pos              (19U)
#define DMA2D_IFCR_CGPF3IF_Msk              (0x1UL << DMA2D_IFCR_CGPF3IF_Pos)       /*!< 0x00000800 */
#define DMA2D_IFCR_CGPF3IF                  DMA2D_IFCR_CGPF3IF_Msk                  /*!< Clears General Purpose Flag 3 Interrupt Flag */

/********************  Bit definition for DMA2D_FGMAR register  ***************/
#define DMA2D_FGMAR_MA_Pos                  (0U)
#define DMA2D_FGMAR_MA_Msk                  (0xFFFFFFFFUL << DMA2D_FGMAR_MA_Pos)    /*!< 0xFFFFFFFF */
#define DMA2D_FGMAR_MA                      DMA2D_FGMAR_MA_Msk                      /*!< Foreground Memory Address */

/********************  Bit definition for DMA2D_FGOR register  ****************/
#define DMA2D_FGOR_LO_Pos                   (0U)
#define DMA2D_FGOR_LO_Msk                   (0xFFFFUL << DMA2D_FGOR_LO_Pos)         /*!< 0x0000FFFF */
#define DMA2D_FGOR_LO                       DMA2D_FGOR_LO_Msk                       /*!< Line Offset */

/********************  Bit definition for DMA2D_FGMSR register  ****************/
#define DMA2D_FGMSR_HPRE_Pos                (0U)
#define DMA2D_FGMSR_HPRE_Msk                (0xFUL << DMA2D_FGMSR_HPRE_Pos)         /*!< 0x0000000F */
#define DMA2D_FGMSR_HPRE                    DMA2D_FGMSR_HPRE_Msk                    /*!< Line Offset */
#define DMA2D_FGMSR_HTRAIL_Pos              (8U)
#define DMA2D_FGMSR_HTRAIL_Msk              (0xFUL << DMA2D_FGMSR_HTRAIL_Pos)       /*!< 0x00000F00 */
#define DMA2D_FGMSR_HTRAIL                  DMA2D_FGMSR_HTRAIL_Msk                  /*!< Line Offset */
#define DMA2D_FGMSR_VPRE_Pos                (16U)
#define DMA2D_FGMSR_VPRE_Msk                (0xFUL << DMA2D_FGMSR_VPRE_Pos)         /*!< 0x000F0000 */
#define DMA2D_FGMSR_VPRE                    DMA2D_FGMSR_VPRE_Msk                    /*!< Line Offset */
#define DMA2D_FGMSR_VTRAIL_Pos              (24U)
#define DMA2D_FGMSR_VTRAIL_Msk              (0xFUL << DMA2D_FGMSR_VTRAIL_Pos)       /*!< 0x0F000000 */
#define DMA2D_FGMSR_VTRAIL                  DMA2D_FGMSR_VTRAIL_Msk                  /*!< Line Offset */

/********************  Bit definition for DMA2D_FGPFCCR register  *************/
#define DMA2D_FGPFCCR_CM_Pos                (0U)
#define DMA2D_FGPFCCR_CM_Msk                (0xFUL << DMA2D_FGPFCCR_CM_Pos)         /*!< 0x0000000F */
#define DMA2D_FGPFCCR_CM                    DMA2D_FGPFCCR_CM_Msk                    /*!< Input color mode CM[3:0] */
#define DMA2D_FGPFCCR_CM_0                  (0x1UL << DMA2D_FGPFCCR_CM_Pos)         /*!< 0x00000001 */
#define DMA2D_FGPFCCR_CM_1                  (0x2UL << DMA2D_FGPFCCR_CM_Pos)         /*!< 0x00000002 */
#define DMA2D_FGPFCCR_CM_2                  (0x4UL << DMA2D_FGPFCCR_CM_Pos)         /*!< 0x00000004 */
#define DMA2D_FGPFCCR_CM_3                  (0x8UL << DMA2D_FGPFCCR_CM_Pos)         /*!< 0x00000008 */
#define DMA2D_FGPFCCR_START_Pos             (5U)
#define DMA2D_FGPFCCR_START_Msk             (0x1UL << DMA2D_FGPFCCR_START_Pos)      /*!< 0x00000020 */
#define DMA2D_FGPFCCR_START                 DMA2D_FGPFCCR_START_Msk                 /*!< Start */
#define DMA2D_FGPFCCR_CS_Pos                (8U)
#define DMA2D_FGPFCCR_CS_Msk                (0xFFUL << DMA2D_FGPFCCR_CS_Pos)        /*!< 0x0000FF00 */
#define DMA2D_FGPFCCR_CS                    DMA2D_FGPFCCR_CS_Msk                    /*!< CLUT size */
#define DMA2D_FGPFCCR_AM_Pos                (16U)
#define DMA2D_FGPFCCR_AM_Msk                (0x3UL << DMA2D_FGPFCCR_AM_Pos)         /*!< 0x00030000 */
#define DMA2D_FGPFCCR_AM                    DMA2D_FGPFCCR_AM_Msk                    /*!< Alpha mode AM[1:0] */
#define DMA2D_FGPFCCR_AM_0                  (0x1UL << DMA2D_FGPFCCR_AM_Pos)         /*!< 0x00010000 */
#define DMA2D_FGPFCCR_AM_1                  (0x2UL << DMA2D_FGPFCCR_AM_Pos)         /*!< 0x00020000 */
#define DMA2D_FGPFCCR_CSS_Pos               (18U)
#define DMA2D_FGPFCCR_CSS_Msk               (0x3UL << DMA2D_FGPFCCR_CSS_Pos)        /*!< 0x000C0000 */
#define DMA2D_FGPFCCR_CSS                   DMA2D_FGPFCCR_CSS_Msk                   /*!< Chroma Sub-Sampling */
#define DMA2D_FGPFCCR_CSS_0                 (0x1UL << DMA2D_FGPFCCR_CSS_Pos)        /*!< 0x00040000 */
#define DMA2D_FGPFCCR_CSS_1                 (0x2UL << DMA2D_FGPFCCR_CSS_Pos)        /*!< 0x00080000 */
#define DMA2D_FGPFCCR_AI_Pos                (20U)
#define DMA2D_FGPFCCR_AI_Msk                (0x1UL << DMA2D_FGPFCCR_AI_Pos)         /*!< 0x00100000 */
#define DMA2D_FGPFCCR_AI                    DMA2D_FGPFCCR_AI_Msk                    /*!< Foreground Input Alpha Inverted */
#define DMA2D_FGPFCCR_RBS_Pos               (21U)
#define DMA2D_FGPFCCR_RBS_Msk               (0x1UL << DMA2D_FGPFCCR_RBS_Pos)        /*!< 0x00200000 */
#define DMA2D_FGPFCCR_RBS                   DMA2D_FGPFCCR_RBS_Msk                   /*!< Foreground Input Red Blue Swap */
#define DMA2D_FGPFCCR_APOS_Pos              (22U)
#define DMA2D_FGPFCCR_APOS_Msk              (0x1UL << DMA2D_FGPFCCR_APOS_Pos)       /*!< 0x00400000 */
#define DMA2D_FGPFCCR_APOS                  DMA2D_FGPFCCR_APOS_Msk                  /*!< Alpha Inverted Position */
#define DMA2D_FGPFCCR_ALPHA_Pos             (24U)
#define DMA2D_FGPFCCR_ALPHA_Msk             (0xFFUL << DMA2D_FGPFCCR_ALPHA_Pos)     /*!< 0xFF000000 */
#define DMA2D_FGPFCCR_ALPHA                 DMA2D_FGPFCCR_ALPHA_Msk                 /*!< Alpha value */

/********************  Bit definition for DMA2D_FGCOLR register  **************/
#define DMA2D_FGCOLR_BLUE_Pos               (0U)
#define DMA2D_FGCOLR_BLUE_Msk               (0xFFUL << DMA2D_FGCOLR_BLUE_Pos)       /*!< 0x000000FF */
#define DMA2D_FGCOLR_BLUE                   DMA2D_FGCOLR_BLUE_Msk                   /*!< Foreground Blue Value */
#define DMA2D_FGCOLR_GREEN_Pos              (8U)
#define DMA2D_FGCOLR_GREEN_Msk              (0xFFUL << DMA2D_FGCOLR_GREEN_Pos)      /*!< 0x0000FF00 */
#define DMA2D_FGCOLR_GREEN                  DMA2D_FGCOLR_GREEN_Msk                  /*!< Foreground Green Value */
#define DMA2D_FGCOLR_RED_Pos                (16U)
#define DMA2D_FGCOLR_RED_Msk                (0xFFUL << DMA2D_FGCOLR_RED_Pos)        /*!< 0x00FF0000 */
#define DMA2D_FGCOLR_RED                    DMA2D_FGCOLR_RED_Msk                    /*!< Foreground Red Value */

