zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f4xx.h
#define PLAY_FLSTAT_FLAGD11_Pos         (11U)
#define PLAY_FLSTAT_FLAGD11_Msk         (0x01UL << PLAY_FLSTAT_FLAGD11_Pos)     /*!< 0x00000800 */
#define PLAY_FLSTAT_FLAGD11             PLAY_FLSTAT_FLAGD11_Msk                 /*!< Flag Output Direct11 */

#define PLAY_FLSTAT_FLAGD12_Pos         (12U)
#define PLAY_FLSTAT_FLAGD12_Msk         (0x01UL << PLAY_FLSTAT_FLAGD12_Pos)     /*!< 0x00001000 */
#define PLAY_FLSTAT_FLAGD12             PLAY_FLSTAT_FLAGD12_Msk                 /*!< Flag Output Direct12 */

#define PLAY_FLSTAT_FLAGD13_Pos         (13U)
#define PLAY_FLSTAT_FLAGD13_Msk         (0x01UL << PLAY_FLSTAT_FLAGD13_Pos)     /*!< 0x00002000 */
#define PLAY_FLSTAT_FLAGD13             PLAY_FLSTAT_FLAGD13_Msk                 /*!< Flag Output Direct13 */

#define PLAY_FLSTAT_FLAGD14_Pos         (14U)
#define PLAY_FLSTAT_FLAGD14_Msk         (0x01UL << PLAY_FLSTAT_FLAGD14_Pos)     /*!< 0x00004000 */
#define PLAY_FLSTAT_FLAGD14             PLAY_FLSTAT_FLAGD14_Msk                 /*!< Flag Output Direct14 */

#define PLAY_FLSTAT_FLAGD15_Pos         (15U)
#define PLAY_FLSTAT_FLAGD15_Msk         (0x01UL << PLAY_FLSTAT_FLAGD15_Pos)     /*!< 0x00008000 */
#define PLAY_FLSTAT_FLAGD15             PLAY_FLSTAT_FLAGD15_Msk                 /*!< Flag Output Direct15 */

#define PLAY_FLSTAT_FLAGR0_Pos          (16U)
#define PLAY_FLSTAT_FLAGR0_Msk          (0x01UL << PLAY_FLSTAT_FLAGR0_Pos)      /*!< 0x00010000 */
#define PLAY_FLSTAT_FLAGR0              PLAY_FLSTAT_FLAGR0_Msk                  /*!< Flag Output Register 0 */

#define PLAY_FLSTAT_FLAGR1_Pos          (17U)
#define PLAY_FLSTAT_FLAGR1_Msk          (0x01UL << PLAY_FLSTAT_FLAGR1_Pos)      /*!< 0x00020000 */
#define PLAY_FLSTAT_FLAGR1              PLAY_FLSTAT_FLAGR1_Msk                  /*!< Flag Output Register 1 */

#define PLAY_FLSTAT_FLAGR2_Pos          (18U)
#define PLAY_FLSTAT_FLAGR2_Msk          (0x01UL << PLAY_FLSTAT_FLAGR2_Pos)      /*!< 0x00040000 */
#define PLAY_FLSTAT_FLAGR2              PLAY_FLSTAT_FLAGR2_Msk                  /*!< Flag Output Register 2 */

#define PLAY_FLSTAT_FLAGR3_Pos          (19U)
#define PLAY_FLSTAT_FLAGR3_Msk          (0x01UL << PLAY_FLSTAT_FLAGR3_Pos)      /*!< 0x00080000 */
#define PLAY_FLSTAT_FLAGR3              PLAY_FLSTAT_FLAGR3_Msk                  /*!< Flag Output Register 3 */

#define PLAY_FLSTAT_FLAGR4_Pos          (20U)
#define PLAY_FLSTAT_FLAGR4_Msk          (0x01UL << PLAY_FLSTAT_FLAGR4_Pos)      /*!< 0x00100000 */
#define PLAY_FLSTAT_FLAGR4              PLAY_FLSTAT_FLAGR4_Msk                  /*!< Flag Output Register 4 */

#define PLAY_FLSTAT_FLAGR5_Pos          (21U)
#define PLAY_FLSTAT_FLAGR5_Msk          (0x01UL << PLAY_FLSTAT_FLAGR5_Pos)      /*!< 0x00200000 */
#define PLAY_FLSTAT_FLAGR5              PLAY_FLSTAT_FLAGR5_Msk                  /*!< Flag Output Register 5 */

#define PLAY_FLSTAT_FLAGR6_Pos          (22U)
#define PLAY_FLSTAT_FLAGR6_Msk          (0x01UL << PLAY_FLSTAT_FLAGR6_Pos)      /*!< 0x00400000 */
#define PLAY_FLSTAT_FLAGR6              PLAY_FLSTAT_FLAGR6_Msk                  /*!< Flag Output Register 6 */

#define PLAY_FLSTAT_FLAGR7_Pos          (23U)
#define PLAY_FLSTAT_FLAGR7_Msk          (0x01UL << PLAY_FLSTAT_FLAGR7_Pos)      /*!< 0x00800000 */
#define PLAY_FLSTAT_FLAGR7              PLAY_FLSTAT_FLAGR7_Msk                  /*!< Flag Output Register 7 */

#define PLAY_FLSTAT_FLAGR8_Pos          (24U)
#define PLAY_FLSTAT_FLAGR8_Msk          (0x01UL << PLAY_FLSTAT_FLAGR8_Pos)      /*!< 0x01000000 */
#define PLAY_FLSTAT_FLAGR8              PLAY_FLSTAT_FLAGR8_Msk                  /*!< Flag Output Register 8 */

#define PLAY_FLSTAT_FLAGR9_Pos          (25U)
#define PLAY_FLSTAT_FLAGR9_Msk          (0x01UL << PLAY_FLSTAT_FLAGR9_Pos)      /*!< 0x02000000 */
#define PLAY_FLSTAT_FLAGR9              PLAY_FLSTAT_FLAGR9_Msk                  /*!< Flag Output Register 9 */

#define PLAY_FLSTAT_FLAGR10_Pos         (26U)
#define PLAY_FLSTAT_FLAGR10_Msk         (0x01UL << PLAY_FLSTAT_FLAGR10_Pos)     /*!< 0x04000000 */
#define PLAY_FLSTAT_FLAGR10             PLAY_FLSTAT_FLAGR10_Msk                 /*!< Flag Output Register 10 */

#define PLAY_FLSTAT_FLAGR11_Pos         (27U)
#define PLAY_FLSTAT_FLAGR11_Msk         (0x01UL << PLAY_FLSTAT_FLAGR11_Pos)     /*!< 0x08000000 */
#define PLAY_FLSTAT_FLAGR11             PLAY_FLSTAT_FLAGR11_Msk                 /*!< Flag Output Register 11 */

#define PLAY_FLSTAT_FLAGR12_Pos         (28U)
#define PLAY_FLSTAT_FLAGR12_Msk         (0x01UL << PLAY_FLSTAT_FLAGR12_Pos)     /*!< 0x10000000 */
#define PLAY_FLSTAT_FLAGR12             PLAY_FLSTAT_FLAGR12_Msk                 /*!< Flag Output Register 12 */

#define PLAY_FLSTAT_FLAGR13_Pos         (29U)
#define PLAY_FLSTAT_FLAGR13_Msk         (0x01UL << PLAY_FLSTAT_FLAGR13_Pos)     /*!< 0x20000000 */
#define PLAY_FLSTAT_FLAGR13             PLAY_FLSTAT_FLAGR13_Msk                 /*!< Flag Output Register 13 */

#define PLAY_FLSTAT_FLAGR14_Pos         (30U)
#define PLAY_FLSTAT_FLAGR14_Msk         (0x01UL << PLAY_FLSTAT_FLAGR14_Pos)     /*!< 0x40000000 */
#define PLAY_FLSTAT_FLAGR14             PLAY_FLSTAT_FLAGR14_Msk                 /*!< Flag Output Register 14 */

#define PLAY_FLSTAT_FLAGR15_Pos         (31U)
#define PLAY_FLSTAT_FLAGR15_Msk         (0x01UL << PLAY_FLSTAT_FLAGR15_Pos)     /*!< 0x80000000 */
#define PLAY_FLSTAT_FLAGR15             PLAY_FLSTAT_FLAGR15_Msk                 /*!< Flag Output Register 15 */

/******************  Bit definition for PLAY_FLSET register  ******************/
#define PLAY_FLSET_FLAGD_SET0_Pos       (0U)
#define PLAY_FLSET_FLAGD_SET0_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET0_Pos)   /*!< 0x00000001 */
#define PLAY_FLSET_FLAGD_SET0           PLAY_FLSET_FLAGD_SET0_Msk               /*!< Flag Output Direct0 */

#define PLAY_FLSET_FLAGD_SET1_Pos       (1U)
#define PLAY_FLSET_FLAGD_SET1_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET1_Pos)   /*!< 0x00000002 */
#define PLAY_FLSET_FLAGD_SET1           PLAY_FLSET_FLAGD_SET1_Msk               /*!< Flag Output Direct1 */

#define PLAY_FLSET_FLAGD_SET2_Pos       (2U)
#define PLAY_FLSET_FLAGD_SET2_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET2_Pos)   /*!< 0x00000004 */
#define PLAY_FLSET_FLAGD_SET2           PLAY_FLSET_FLAGD_SET2_Msk               /*!< Flag Output Direct2 */

#define PLAY_FLSET_FLAGD_SET3_Pos       (3U)
#define PLAY_FLSET_FLAGD_SET3_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET3_Pos)   /*!< 0x00000008 */
#define PLAY_FLSET_FLAGD_SET3           PLAY_FLSET_FLAGD_SET3_Msk               /*!< Flag Output Direct3 */

#define PLAY_FLSET_FLAGD_SET4_Pos       (4U)
#define PLAY_FLSET_FLAGD_SET4_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET4_Pos)   /*!< 0x00000010 */
#define PLAY_FLSET_FLAGD_SET4           PLAY_FLSET_FLAGD_SET4_Msk               /*!< Flag Output Direct4 */

#define PLAY_FLSET_FLAGD_SET5_Pos       (5U)
#define PLAY_FLSET_FLAGD_SET5_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET5_Pos)   /*!< 0x00000020 */
#define PLAY_FLSET_FLAGD_SET5           PLAY_FLSET_FLAGD_SET5_Msk               /*!< Flag Output Direct5 */

#define PLAY_FLSET_FLAGD_SET6_Pos       (6U)
#define PLAY_FLSET_FLAGD_SET6_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET6_Pos)   /*!< 0x00000040 */
#define PLAY_FLSET_FLAGD_SET6           PLAY_FLSET_FLAGD_SET6_Msk               /*!< Flag Output Direct6 */

