zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/soc/stm32h5f4xx.h
#define PLAY_FLSET_FLAGD_SET7_Pos       (7U)
#define PLAY_FLSET_FLAGD_SET7_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET7_Pos)   /*!< 0x00000080 */
#define PLAY_FLSET_FLAGD_SET7           PLAY_FLSET_FLAGD_SET7_Msk               /*!< Flag Output Direct7 */

#define PLAY_FLSET_FLAGD_SET8_Pos       (8U)
#define PLAY_FLSET_FLAGD_SET8_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET8_Pos)   /*!< 0x00000100 */
#define PLAY_FLSET_FLAGD_SET8           PLAY_FLSET_FLAGD_SET8_Msk               /*!< Flag Output Direct8 */

#define PLAY_FLSET_FLAGD_SET9_Pos       (9U)
#define PLAY_FLSET_FLAGD_SET9_Msk       (0x01UL << PLAY_FLSET_FLAGD_SET9_Pos)   /*!< 0x00000200 */
#define PLAY_FLSET_FLAGD_SET9           PLAY_FLSET_FLAGD_SET9_Msk               /*!< Flag Output Direct9 */

#define PLAY_FLSET_FLAGD_SET10_Pos      (10U)
#define PLAY_FLSET_FLAGD_SET10_Msk      (0x01UL << PLAY_FLSET_FLAGD_SET10_Pos)  /*!< 0x00000400 */
#define PLAY_FLSET_FLAGD_SET10          PLAY_FLSET_FLAGD_SET10_Msk              /*!< Flag Output Direct10 */

#define PLAY_FLSET_FLAGD_SET11_Pos      (11U)
#define PLAY_FLSET_FLAGD_SET11_Msk      (0x01UL << PLAY_FLSET_FLAGD_SET11_Pos)  /*!< 0x00000800 */
#define PLAY_FLSET_FLAGD_SET11          PLAY_FLSET_FLAGD_SET11_Msk              /*!< Flag Output Direct11 */

#define PLAY_FLSET_FLAGD_SET12_Pos      (12U)
#define PLAY_FLSET_FLAGD_SET12_Msk      (0x01UL << PLAY_FLSET_FLAGD_SET12_Pos)  /*!< 0x00001000 */
#define PLAY_FLSET_FLAGD_SET12          PLAY_FLSET_FLAGD_SET12_Msk              /*!< Flag Output Direct12 */

#define PLAY_FLSET_FLAGD_SET13_Pos      (13U)
#define PLAY_FLSET_FLAGD_SET13_Msk      (0x01UL << PLAY_FLSET_FLAGD_SET13_Pos)  /*!< 0x00002000 */
#define PLAY_FLSET_FLAGD_SET13          PLAY_FLSET_FLAGD_SET13_Msk              /*!< Flag Output Direct13 */

#define PLAY_FLSET_FLAGD_SET14_Pos      (14U)
#define PLAY_FLSET_FLAGD_SET14_Msk      (0x01UL << PLAY_FLSET_FLAGD_SET14_Pos)  /*!< 0x00004000 */
#define PLAY_FLSET_FLAGD_SET14          PLAY_FLSET_FLAGD_SET14_Msk              /*!< Flag Output Direct14 */

#define PLAY_FLSET_FLAGD_SET15_Pos      (15U)
#define PLAY_FLSET_FLAGD_SET15_Msk      (0x01UL << PLAY_FLSET_FLAGD_SET15_Pos)  /*!< 0x00008000 */
#define PLAY_FLSET_FLAGD_SET15          PLAY_FLSET_FLAGD_SET15_Msk              /*!< Flag Output Direct15 */

#define PLAY_FLSET_FLAGR_SET0_Pos       (16U)
#define PLAY_FLSET_FLAGR_SET0_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET0_Pos)   /*!< 0x00010000 */
#define PLAY_FLSET_FLAGR_SET0           PLAY_FLSET_FLAGR_SET0_Msk               /*!< Flag Output Register 0 */

#define PLAY_FLSET_FLAGR_SET1_Pos       (17U)
#define PLAY_FLSET_FLAGR_SET1_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET1_Pos)   /*!< 0x00020000 */
#define PLAY_FLSET_FLAGR_SET1           PLAY_FLSET_FLAGR_SET1_Msk               /*!< Flag Output Register 1 */

#define PLAY_FLSET_FLAGR_SET2_Pos       (18U)
#define PLAY_FLSET_FLAGR_SET2_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET2_Pos)   /*!< 0x00040000 */
#define PLAY_FLSET_FLAGR_SET2           PLAY_FLSET_FLAGR_SET2_Msk               /*!< Flag Output Register 2 */

#define PLAY_FLSET_FLAGR_SET3_Pos       (19U)
#define PLAY_FLSET_FLAGR_SET3_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET3_Pos)   /*!< 0x00080000 */
#define PLAY_FLSET_FLAGR_SET3           PLAY_FLSET_FLAGR_SET3_Msk               /*!< Flag Output Register 3 */

#define PLAY_FLSET_FLAGR_SET4_Pos       (20U)
#define PLAY_FLSET_FLAGR_SET4_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET4_Pos)   /*!< 0x00100000 */
#define PLAY_FLSET_FLAGR_SET4           PLAY_FLSET_FLAGR_SET4_Msk               /*!< Flag Output Register 4 */

#define PLAY_FLSET_FLAGR_SET5_Pos       (21U)
#define PLAY_FLSET_FLAGR_SET5_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET5_Pos)   /*!< 0x00200000 */
#define PLAY_FLSET_FLAGR_SET5           PLAY_FLSET_FLAGR_SET5_Msk               /*!< Flag Output Register 5 */

#define PLAY_FLSET_FLAGR_SET6_Pos       (22U)
#define PLAY_FLSET_FLAGR_SET6_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET6_Pos)   /*!< 0x00400000 */
#define PLAY_FLSET_FLAGR_SET6           PLAY_FLSET_FLAGR_SET6_Msk               /*!< Flag Output Register 6 */

#define PLAY_FLSET_FLAGR_SET7_Pos       (23U)
#define PLAY_FLSET_FLAGR_SET7_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET7_Pos)   /*!< 0x00800000 */
#define PLAY_FLSET_FLAGR_SET7           PLAY_FLSET_FLAGR_SET7_Msk               /*!< Flag Output Register 7 */

#define PLAY_FLSET_FLAGR_SET8_Pos       (24U)
#define PLAY_FLSET_FLAGR_SET8_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET8_Pos)   /*!< 0x01000000 */
#define PLAY_FLSET_FLAGR_SET8           PLAY_FLSET_FLAGR_SET8_Msk               /*!< Flag Output Register 8 */

#define PLAY_FLSET_FLAGR_SET9_Pos       (25U)
#define PLAY_FLSET_FLAGR_SET9_Msk       (0x01UL << PLAY_FLSET_FLAGR_SET9_Pos)   /*!< 0x02000000 */
#define PLAY_FLSET_FLAGR_SET9           PLAY_FLSET_FLAGR_SET9_Msk               /*!< Flag Output Register 9 */

#define PLAY_FLSET_FLAGR_SET10_Pos      (26U)
#define PLAY_FLSET_FLAGR_SET10_Msk      (0x01UL << PLAY_FLSET_FLAGR_SET10_Pos)  /*!< 0x04000000 */
#define PLAY_FLSET_FLAGR_SET10          PLAY_FLSET_FLAGR_SET10_Msk              /*!< Flag Output Register 10 */

#define PLAY_FLSET_FLAGR_SET11_Pos      (27U)
#define PLAY_FLSET_FLAGR_SET11_Msk      (0x01UL << PLAY_FLSET_FLAGR_SET11_Pos)  /*!< 0x08000000 */
#define PLAY_FLSET_FLAGR_SET11          PLAY_FLSET_FLAGR_SET11_Msk              /*!< Flag Output Register 11 */

#define PLAY_FLSET_FLAGR_SET12_Pos      (28U)
#define PLAY_FLSET_FLAGR_SET12_Msk      (0x01UL << PLAY_FLSET_FLAGR_SET12_Pos)  /*!< 0x10000000 */
#define PLAY_FLSET_FLAGR_SET12          PLAY_FLSET_FLAGR_SET12_Msk              /*!< Flag Output Register 12 */

#define PLAY_FLSET_FLAGR_SET13_Pos      (29U)
#define PLAY_FLSET_FLAGR_SET13_Msk      (0x01UL << PLAY_FLSET_FLAGR_SET13_Pos)  /*!< 0x20000000 */
#define PLAY_FLSET_FLAGR_SET13          PLAY_FLSET_FLAGR_SET13_Msk              /*!< Flag Output Register 13 */

#define PLAY_FLSET_FLAGR_SET14_Pos      (30U)
#define PLAY_FLSET_FLAGR_SET14_Msk      (0x01UL << PLAY_FLSET_FLAGR_SET14_Pos)  /*!< 0x40000000 */
#define PLAY_FLSET_FLAGR_SET14          PLAY_FLSET_FLAGR_SET14_Msk              /*!< Flag Output Register 14 */

